MyrddinoptRoodt/LaserTag_esp8266/src/main.cpp
//set-up for default team and gun (legacy)
int teams = 0;
String gun = FFAGUN;
int guns = 100;

//codes for the damage also used in server games
String Damagex1   = "01";
String Damagex2   = "10";
String Damagex3   = "11";

//buttons
const uint16_t buzzer = 0;              //D3    //As the name sugest, this is the pin used for the buzzer (or in our case the transisor driving the buzzer)
const uint16_t ChangeTeams_Button = 12; //d6    //This button as function to change the team when in a non connected status.
const uint16_t button_Shoot = 13;       //D7    pushbutton connected to digital pin D7. this button activates the shoot code.
const uint8_t ChangeGuns_Button = 16;   //D0    button to change the gun type //this button changes the type of gun when not connected to a server
const uint8_t Reload_Button = A0;       //A0    reload button on A0  //used to reload the bullets variable.

int val = 0;      // variable to store the read value

//some standard values
int bullets     = 6;        //amount of bullets for default gun
int Health      = 9;        //you start with 9hp (also true for server games)
int bullet_type = bullet1x; //sets the amount of bullets for each 'clip'
int time_wait   = 0;        //cooldown for actions
int gun_delay   = 10;       //default cooldown for default gun

//wifi setup
const char* ssid = "NETGEAR";             //fill in the 2.4ghz wifi name 
const char* password = "";                //fill in the wifi password
const char* mqtt_server = "192.168.1.5";  //the address of the mqtt-server NOTICE: this is a local ip address, use the same network on the server.

//mqtt setup (part 1)
unsigned long lastMsg = 0;
#define MSG_BUFFER_SIZE	(50)
char msg[MSG_BUFFER_SIZE];
int value = 0;

String tempstring = Cown + Damagex1 + idstring;//the standaard string to send to the server: ownteamID + damage(type) + Id

//wifi loading funcion
void setup_wifi() {

  delay(10);

  // We start by connecting to a WiFi network
  Serial.println();
  Serial.print("Connecting to ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);

  // As long as we are not connected, the sp wil try to reconnect REMINDME !!!
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");

  }

  Serial.println("");
  Serial.println("WiFi connected");
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());
}

//mqtt call back function (this function should be used to pull data from the server), listens on MQTT connection for incomming messages: (channel, message length)
void callback(char* topic, byte* payload, unsigned int length) {                              
  
  //For debugging, the esp prints whenever a message has arived, on with topic/channel it did.
  Serial.print("Message arrived [");
  Serial.print(topic);
  Serial.print("] ");
  
  //This statement checks if the channel is "time", if it is, the ESP will send a message to the server as follows: ID # Health # bullets # totalbullets. If it is not, the message is passed along
  if (topic == "time"){
    snprintf (msg, MSG_BUFFER_SIZE, "%ld#%ld#%ld#%ld", idd, Health, bullets, totalbullets);
    Serial.print("Publish message: ");
    Serial.println(msg);
    client.publish("1", msg);
  }

                                  //If the topic is the same as its own ID, the message is regarded as a configuration. The esp will configure its stelf to the given parameters.
  if (topic[0] == idd){           //This way the ID can not be more than 9, first character of he topic has to be the same as the Id
    
    String Cteam = "";            //Firstly some 'fresh' Strings are made and cleared REMINDME !!!
    String Cdam = "";
    Cteam.clear();
    Cdam.clear();

   
    switch (payload[0])           //This switch statment tries to match the first character of the message with a certain case, This field will define to wich team the gun belongs.
    {
    case '1':
      Cteam = CBLUE;              //Sets the team value (the binary string) via the presets
      leds[1] = CRGB::Blue;       //Sets the correct collour of the RGBLED
      ownTeam = "CBLUE";          //used for debugging, nor real "purpose"
    case '2':
      Cteam = CRED;
      leds[1] = CRGB::Red;
      ownTeam = "CRED";
    case '3':
      Cteam = CGREEN;
      leds[1] = CRGB::Green;
      ownTeam = "CGREEN";
      
    case '4':
      Cteam = CWHITE;
      leds[1] = CRGB::White;
      ownTeam = "CWHITE";
      
    case '5':
      Cteam = CFFA;
      leds[1] = CRGB::Purple;
      ownTeam = "CFFA";
    default:                      //Sets the default values (it falls back to '1')
      Cteam = CFFA;
      leds[1] = CRGB::Purple;
      ownTeam = "CFFA";
    }


    switch (payload[1])           //Here the second haracter is compared against the cases. Here the damage type (1x, 2x, 3x) gets set. 
    {                             //The bullettype (the amount of bullets in a clip) gets set as well.
    case '1':
      Cdam = Damagex1;            //The damage gets set via the presets of damage type
      bullet_type = 9;            //The bullettype is set  to custom values, it can be overridden by the next function.
    case '2':
      Cdam = Damagex2;
      bullet_type = 6;   
    case '3':
      Cdam = Damagex3;
      bullet_type = 3;
    default:
      Cdam = Damagex1;
      bullet_type = 9;
    }


    if (payload[3])               //If the payload contains 3 charachers, the third one will overide
    {                             //the earlier defined bullet type with the value in payload[3]
      bullet_type = payload[3];
      if (payload[3] = '0')
      {
        bullet_type = 10;
      }
      
    }
    
    tempstring.clear();                         //The default send string is cleared so that it can be build with new values.
    tempstring = Cteam + Cdam + idstring;       //This string contains all data that wil be send over IR, you can compare to the realier defined default string
    //String tempstring = Cown + Damagex1 + idstring;
    Serial.println(" received configuration "); //To ease debugging, the esp prints to serial whenever it receives a configuration. 
  }
}

//display functions: this configures the screen overlay, and sets some values: like font, text alignment,... This is not actively used.
void msOverlay(OLEDDisplay *display, OLEDDisplayUiState* state) {
  display->setTextAlignment(TEXT_ALIGN_RIGHT);
  display->setFont(ArialMT_Plain_10);
  display->drawString(128, 0, String(millis()));
}

//this function contains information about the first 'screen tab'
void drawFrame1(OLEDDisplay *display, OLEDDisplayUiState* state, int16_t x, int16_t y) {
  display->setTextAlignment(TEXT_ALIGN_LEFT);
  display->setFont(ArialMT_Plain_16);
  String status = "Not connected";
  if (connected){
   status.clear();
   status.concat("Connected");
  }
  display->drawString(0 + x, 10 + y, status);

