MyrddinoptRoodt/LaserTag_esp8266/src/main.cpp
void prepare_shot(String shot){ // this function prepares, and fires the shot, first it will create a string to send in binary, then it will translate the string to a raw array, wich will be send as is
  String list = "01";           // this is an array of sorts to compare values against.
  u_int i = 0;                  // this is is used instead of a for loop.
  int array_place = 17;         // defines the starting poition in the raw- or mawdata
  String temp = "";             // initialises the string
  
  // when the esp is not connected, this piece of the code is used.
  while ((i <= shot.length()) and (!connected)) 
  {
    
    // This part builds the array in a correct way, it reads a binary string, if it encounters a 1: it adds 786, if it encounters a 0 it places a 393  
    if (shot.charAt(i) == list[1]){
      rawData[array_place] = 786;
      array_place++;
      temp = temp + 786;
    }
    if (shot.charAt(i) == list[0])
    {
      rawData[array_place] = 393;
      array_place++;
      temp = temp + 786;
      }
    i++;


  }

  // when the is IS connected, this part of the code is executed. (the difference is the shorter templkate string, MawData is shorter than RawData)
  while ((i <= shot.length())and(connected))
  {
    // This part builds the array in a correct way, it reads a binary string, if it encounters a 1: it adds 786, if it encounters a 0 it places a 393
    if (shot.charAt(i) == list[1]){
      MawData[array_place] = 786;
      array_place++;
      temp = temp + 786;
    }
    if (shot.charAt(i) == list[0])
    {
      MawData[array_place] = 393;
      array_place++;
      temp = temp + 786;
          }
    i++;
  }


  Serial.print("Shoot: ");            //while the esp is connected to a serial monitor, this wil display when the esp shoots: it is usefull to get more insight on what the esp is doeing
  Serial.println(temp);
  

  if (connected)                      //when the esp is connected, it shoots the MawData array, else, it shoots the rawData array and waits for a short while to prevent spam shooting
  {
    irsend.sendRaw(MawData,30,38);
  }else{  
  irsend.sendRaw(rawData,42,38);
  }
  time_wait = (10 / bullet_type)*15;
}


//as the name sugests, this function stands in to calculate the received damage, it also calls the buzzer funcion for audible feedback when shot
void get_damage(String temp){         
  // First this function tests what type of damage is received, whereafter it also suptracts the approirate amount of health.
  // it also gives a shot beeb after being shot, this beep is differenbt for each case, when the HP dops below 1, it once again wil give a longer beeb.
  // to aid debugging, there are also serial prints here to validate propper functionning of the gun
  if (temp == Damagex1)         
  {
    Health --;
    buzzerfun(1);
  }
  if (temp == Damagex2)
  {
    Health -= 2;
    buzzerfun(2);
  }
  if (temp == Damagex3)
  {
    Health -= 3;
    buzzerfun(3);
  }
  if (Health < 1)
  {
    Serial.println("Dead");
    buzzerfun(5);
  } 
  Serial.println(Health);
  Serial.println(temp);
}


//as the name sugests, this function stands in to calculate the received damage, it also calls the buzzer funcion for audibel feedback when shot. This overload is used when the gun is connected to the server
//
//needs the damage string, and the int of the enemy
void get_damage(String temp, int enemy){ 
  // First this function tests what type of damage is received, whereafter it also suptracts the approirate amount of health.
  // it also gives a shot beeb after being shot, this beep is differenbt for each case, when the HP dops below 1, it once again wil give a longer beeb.
  // to aid debugging, there are also serial prints here to validate propper functionning of the gun
  // lastly it also sends a message to the server: the message identifies the esp, the remaining health, the total amount of bullets shot, and the enemy that has shot the player.
  if (temp == Damagex1)
  {
    Health --;
    buzzerfun(1);
  }
  if (temp == Damagex2)
  {
    Health -= 2;
    buzzerfun(2);
  }
  if (temp == Damagex3)
  {
    Health -= 3;
    buzzerfun(3);
  }
  if (Health < 1)
  {
    Serial.println("Dead");
    buzzerfun(5);
  } 
  Serial.println(Health);
  Serial.println(temp);

  if (connected)
  {
    snprintf (msg, MSG_BUFFER_SIZE, "%ld#%ld#%ld#%ld#%ld", idd, Health, bullets, totalbullets,enemy);
    Serial.print("Publish message: ");
    Serial.println(msg);
    client.publish("2", msg); //change the '2' to the ID of the esp gun!!! this changes the channel to it's own.
  }  
}


//this function is to "decode" the data, since it is encoded "raw" (manchester encoding?)
// this requires the rewceived array.
void decodeData(uint16_t * Datass){
  //this part is a mess please continue wwith patience

  
  String binairy_code = "";   	  // at the start we initialise a string to store the 'translated' array
  int i = 17;                     // sets the start place for decoding, the first 17 characters in the array are always the same and don't contain anny data.
  Serial.print("Eigen team: ");   // a bit of feedback for debugging
  
  
  
  if (!connected)                 // this opart is the code for when the gun isn't connected to a server.
  {
    Serial.println(eigenteam);
    while (i<41)                  // this part decodes the received values to binary, the first values of the array are static, and already present in this code, the part between place 17 and 41 (not inclusive, also we are programmers: indexes start at 0)
    {
      
      uint16_t value = Datass[i]; 
      if (value > 600)                  //if the value in the array exeedes 600 it is a binnary 1, if not, it is a binnary 0
      {
        binairy_code.concat("1");
      }else {
        binairy_code.concat("0");
      }
      i++;                              //steps a place forward in the array
      
    }



    Serial.print("code: ");
    Serial.println(binairy_code);
    Serial.print("code damage: ");                  //this gets a substring which contain the 'damage' digets to be printed, this will be seen again in the next short while
    
    // Here we isolate a few values from the received string, such as: the team code(temp) and the damage(damage).
    Serial.println(binairy_code.substring(15,17));      
    String temp = binairy_code.substring(5,8);      //this gets the team value from the string
    String damage = binairy_code.substring(15,17);  //this (once again) will remember the damage value
    // jsut fome prints to ease testing/developping
    Serial.println(damage);
    Serial.println(temp);
    
    // here we compare the team of the shooter, and the team of this esp 
    if (((temp == Blue) or (temp == Red) or (temp == Green) or (temp == White)) and (temp != FFA)) //here the code checks if the team is valid, and not ffa(because of the different rules)
    {
      if ((temp != eigenteam) and (eigenteam != FFA)){ //if the team id is valid, and not ffa, amd your team id isn't the same or FFA, the get damage function is called
        get_damage(damage); //passes the damage data to the get_damage function
      }
    }
    if (temp == FFA)        //if both teams 
    {
      if (eigenteam == FFA)
      {
        get_damage(damage);
      }
    }
  }
  else  //AKA if the esp IS connected this part is run.
  {
    // this code is largly the same as the code above
    
