MyrddinoptRoodt/LaserTag_esp8266/src/main.cpp
    }
    if ((digitalRead(ChangeGuns_Button) == HIGH)and (eigenteam != FFA)) //reads the change guns pin, and will attempt to change 'gun type' if it is possible in the given team
    {
      changeGuns();
           
      Serial.print("Gun: ");
      Serial.println(gun);
      Serial.print("Gun ID: ");
      Serial.println(guns);
      Serial.print("Team: ");
      Serial.println(eigenteam);
      time_wait = 5; 
    }    
    if (irrecv.decode(&results)) { //this code will try to read/decode the incomming  signals, and will also post them in the serial interface.
                                   //this will also call the function to take damage (and to recognise the other gun).
    
      Serial.println(resultToSourceCode(&results));
      Serial.println();
      uint16_t * Datass = resultToRawArray(&results);    // Blank line between entries
      decodeData(Datass);
      yield();             // Feed the WDT (again)
      //String hit = resultToTimingInfo(&results);
    }
    time_wait--;
  }
  if ((Health > 0)and(connected)) // as long as you have health you are part of the game, when your hp is drained, the gun doesn't read inputs anymore.
  {
    if (analogRead(Reload_Button) == 1024)
    {
      bullets = bullet_type;
      Serial.print("reload gun: ");
      Serial.println(bullets);
      Serial.println(analogRead(Reload_Button));
      

    }
    switch (Health)//just a check to change the led colour depenging on the remaining health points
    {
    case 1:
    case 2:
    case 3:
      leds[0] = CRGB::Red;
      break;
    case 4:
    case 5:
    case 6:
      leds[0] = CRGB::Orange;
      break;
    case 7:
    case 8:
    case 9:
      leds[0] = CRGB::LimeGreen;
      break;
    default:
      break;

    }
    FastLED.show();

    if (digitalRead(button_Shoot) == HIGH) //readout of pin to detect if button is pressed, and will if so run the function "gun" (aka, it fires the "laser")
    {
      if (bullets>=1){
        prepare_shot(tempstring);
        bullets--;
        Serial.print("Remaining bullets: ");
        Serial.println(bullets);
        buzzerfun(2);
        totalbullets++;
      }
    }
    if (irrecv.decode(&results)) { //this code will try to read/decode the incomming  signals, and will also post them in the serial interface.
                                   //this will also call the function to take damage (and to recognise the other gun).
    
      Serial.println(resultToSourceCode(&results));
      Serial.println();
      uint16_t * Datass = resultToRawArray(&results);    // Blank line between entries
      decodeData(Datass);
      yield();             // Feed the WDT (again)
      //String hit = resultToTimingInfo(&results);
    }
    time_wait--;
  }
  delay(200);
  if (Health <= 0) //this part runs if the health points run out.
  {
    FastLED.clear();
    Serial.println("u dead m8");//this is the message you get when you die
    
    FastLED.clear();
    delay(50);
    leds[0] = CRGB::Red;
    FastLED.show();
    delay(50);
  }
}
